/* The default title for FUIAttachmentsFormCell.\n This string can be overwritten by the \"attachmentsTItle\" property \n in FUIAttachmentsFormCell. */
"AttachmentsFormatKey" = "สิ่งที่แนบ (%d)";

/* Old singular title format */
"AttachmentsKey" = "สิ่งที่แนบ (%d)";

/* The action list title when \"add attachment\" button is tapped. */
"AddAttachmentKey" = "เพิ่มสิ่งที่แนบ";

/* The string for taking a photo in add attachment action list. */
"TakePhotoKey" = "ถ่ายรูป";

/* The string for choosing a photo from the photo library in add attachment action list. */
"PhotoLibraryKey" = "ไลบรารีรูปถ่าย";

/* The voice announcement when an attachment is deleted */
"AttachmentDeletedKey" = "ลบสิ่งที่แนบ %d แล้ว";

/* The string for selecting a file from the document picker in add attachment action list. */
"FilesKey" = "ไฟล์";

/* The string for canceling adding an attachment in add attahment action list. */
"CancelKey" = "ยกเลิก";

/* The default placeholder text for FUITitleFormCell.\n App can use the \"placeholderText\" property of FUITitleFormCell to override this string. */
"TitleKey" = "ชื่อ";

/* The default placeholder text for FUINoteFormCell.\n App can use the \"placeholderText\" property of FUINoteFormCell to override this string. */
"NotesKey" = "บันทึก";

/* The default placeholder text for value field of FUISimplePropertyFormCell.\n App can use the \"placeholderText\" property of FUISimplePropertyFormCell to override this string. */
"ValueKey" = "ค่า";

/* The warning string when there is no navigationController for the current\n UITableViewController for the FUIFormCell. */
"NoNavigationCtlWarningKey" = "คำเตือน: navigationController สำหรับ UITableViewController ปัจจุบันของ FUIFormCell เป็นศูนย์ FUIAttachmentsFormCell และ ListPickerFormCell จะทำงานอย่างไม่ถูกต้อง";

/* The format string for valueTextField of DurationPckerFormCell.\n This string can be overwritten by the \"durationFormatString\" property\n in FUIDurationPickerFormCell. */
"DurationKey" = "%d ชั่วโมง %d นาที";

/* The default keyName for the `FUIDurationPickerFormCell`. */
"Duration" = "ระยะเวลา";

/* The hour label string in the FUIDurationPickerFormCell */
"hourKey" = "ชั่วโมง";

/* The hours label string in the FUIDurationPickerFormCell */
"hoursKey" = "ชั่วโมง";

/* The minute label string in the FUIDurationPickerFormCell */
"minKey" = "นาที";

/* The section header title for selected entries in ListPickerFormCell. */
"SelectedKey" = "เลือกแล้ว";

/* The section header title for all entries in ListPickerFormCell. */
"AllKey" = "ทั้งหมด";

/* The anchor button title for selected entries in `FUIListPickerTableViewController`. */
"SelectedFormatKey" = "เลือกแล้ว (%d)";

/* The anchor button accesibility hint format for multiple selected items. */
"MultipleSelectedFormatKey" = "แตะสองครั้งเพื่อดู %d รายการที่เลือก";

/* The anchor button accesibility hint format for single selected item. */
"SingleSelectedFormatKey" = "แตะสองครั้งเพื่อดูรายการที่เลือก";

/* The alert message for `FUIListPickerTableViewController` pulldown dismissal */
"DiscardSelectionsMessageKey" = "คุณแน่ใจหรือไม่ว่าต้องการละทิ้งรายการที่เลือก?";

/* The alert Discard Changes action title for `FUIListPickerTableViewController` pulldown dismissal */
"DiscardChangesKey" = "ละทิ้งการเปลี่ยนแปลง";

/* The alert Keep Editing action title for `FUIListPickerTableViewController` pulldown dismissal */
"KeepEditingKey" = "แก้ไขต่อไป";

/* The title for the Apply action title for the `FUIListPickerTableViewController` */
"ApplyKey" = "นำไปใช้";

/* The warning string when search is enabled but the `ListPickerFormCell\n` has the `listPickerDataSource` set but `listPickerSearchResultsUpdating\n` property is nil. Search is disabled in this case. */
"NoResultsUpdatingWarningKey" = "คำเตือน: การค้นหาถูกปิดใช้งานเนื่องจากคุณสมบัติ listPickerSearchResultsUpdating ใน ListPickerFormCell เป็นศูนย์";

/* The \"Select All\" button title on the List Picker header */
"SelectAllKey" = "เลือกทั้งหมด";

/* The \"Deselect All\" button title on the List Picker header */
"DeselectAllKey" = "ยกเลิกการเลือกทั้งหมด";

/* The \"Close\" button title on the Barcode Scan View */
"CloseKey" = "ปิด";

/* The \"More\" indicator title displayed in Object Cell when text is truncated, and may be expanded. */
"DisplayMoreKey" = "เพิ่มเติม";

/* The \"Less\" indicator title displayed in Object Cell when text is fully displayed, and may be compressed with truncation. */
"DisplayLessKey" = "น้อยลง";

/* The string for switch button */
"SwitchBUttonKey" = "ปุ่มสลับ";

/* The string used in accessibility indicating switch in on. */
"SwitchOn" = "เปิด";

/* The string used in accessibility indicating switch is off. */
"SwitchOff" = "ปิด";

/* The string used in accessibility informing user to double tap on the switch to toggle between on and off. */
"SwitchTap" = "แตะสองครั้งเพื่อสลับการกำหนดค่า";

/* The default title for FUIOrderPickerFormCell.\n This string can be overwritten by the \"title\" property \n in FUIOrderPickerFormCell. */
"SortByKey" = "จัดเรียงตาม";

/* The sort criterion state for FUIOrderPickerFormItemCell.\n It is used in voice over. */
"NotSelectedKey" = "ไม่ได้เลือก";

/* Criterion view accessibility hint */
"CriterionHintKey" = "แตะสองครั้งเพื่อสลับการเลือก";

/* OrderDirection view accessibility hint */
"OrderDirectionHintKey" = "แตะสองครั้งเพื่อสลับทิศทางการจัดเรียง";

/* FUISliderFormCell accessibility label */
"FUISliderFormCellAccessibilityLabelKey" = "นี่คือแถบเลื่อน %@ ที่ค่าสูงสุดคือ %@ และค่าต่ำสุดคือ %@";

/* FUISliderFormCell accessibility hint */
"FUISliderFormCellAccessibilityHintKey" = "คุณสามารถกวาดนิ้วขึ้น/ลงในขณะที่เลือกองค์ประกอบเพื่อเปลี่ยนค่าของแถบเลื่อน";

/* FUISliderFormCell accessibility value */
"FUISliderFormCellAccessibilityValueKey" = "ค่าปัจจุบันคือ %@";

/* FUISliderFormCell accessibility change value */
"FUISliderFormCellAccessibilityChangeValueKey" = "ค่าปัจจุบันเปลี่ยนเป็น %@";

/* Default hint text for Read-only Field for FUITextFieldFormCell */
"ReadOnlyFieldKey" = "ฟิลด์แบบอ่านอย่างเดียว";

/* Default error text for when the character count reaches the maximum limit for `FUITextFieldFormCell` */
"CharCountReachLimitMsg" = "ไม่มีอักขระเหลือแล้ว";

/* Default error text for when the character count exceeds the maximum limit for `FUITextFieldFormCell`. */
"CharCountBeyondLimitMsg" = "ลดจำนวนของอักขระ";

/* Default accessibility label for Alternative Input Action button name for FUITextFieldFormCell */
"AlternativeInputActionKey" = "การดำเนินการป้อนข้อมูลทางเลือก";

/* Button for accessibility voice over announcement */
"ButtonKey" = "ปุ่ม";

/* Clear Text button title */
"ClearTextKey" = "ล้างข้อความ";

/* Announcement for input text is cleared */
"InputTextClearedKey" = "ล้างข้อความอินพุท";

/* Other accessibility hint strings */
"DoubleTapToOpenKey" = "แตะสองครั้งเพื่อเปิด";

"DoubleTapToCollapseKey" = "แตะสองครั้งเพื่อย่อรวม";

"DoubleTapToSelectFromList" = "แตะสองครั้งเพื่อเลือกจากรายการ";

"DoubleTapToSelect" = "แตะสองครั้งเพื่อเลือก";

"DoubleTapToUnselect" = "แตะสองครั้งเพื่อยกเลิกการเลือก";

"FlashKey" = "ไฟฉาย";

"FlashIsTurnedOnKey" = "ไฟฉายเปิด";

"FlashIsTurnedOffKey" = "ไฟฉายปิด";

"DoubleTapToTurnOnFlashKey" = "แตะสองครั้งเพื่อเปิดไฟฉาย";

"DoubleTapToTurnOffFlashKey" = "แตะสองครั้งเพื่อปิดไฟฉาย";

/* FUIStepperView tip */
"StepperTipKey" = "นี่คือ Stepper ที่สามารถแก้ไขได้";

/* FUIStepperView tip unable be edited */
"StepperTipNotEditableKey" = "นี่คือ Stepper ที่ไม่สามารถแก้ไขได้";

/* FUIStepperView stepper maximum value */
"StepperMaximumValueKey" = "ค่าสูงสุดคือ %@";

/* FUIStepperView stepper minimum value */
"StepperMinimumValueKey" = "ค่าต่ำสุดคือ %@";

/* FUIStepperView increase button */
"StepperIncreaseValueByOneKey" = "เพิ่มค่าทีละ 1";

/* FUIStepperView decrease button */
"StepperDecreaseValueByOneKey" = "ลดค่าทีละ 1";

/* FUIStepperView textField value */
"StepperCurrentValueKey" = "ค่าปัจจุบันคือ";

/* Title for UINavigationBar in the FUISortFilterViewController */
"Filter" = "ฟิลเตอร์";

/* Subtitle for UINavigationBar in the FUISortFilterViewController; \"\\(filteredNum)\" and \"\\(totalNum)\" don't require localization. */
"ResultsOf" = "ผลลัพธ์ \\(filteredNum) จาก \\(totalNum)";

/* Title for Action Button in the FUISortFilterViewController; \"\\(filteredNum)\" doesn't require localization. */
"ShowResults" = "แสดง \\(filteredNum) รายการ";

/* Title for Button \"Reset\" in UINavigationBar to reset filter criteria in the FUISortFilterViewController */
"Reset" = "รีเซ็ต";

/* FUIRangeSliderContentView slider tip */
"SliderTipKey" = "นี่คือแถบเลื่อนที่สามารถแก้ไขได้ ค่าต่ำสุดคือ %@ และค่าสูงสุดคือ %@";

/* FUIRangeSliderContentView slider tip unable be editable */
"SliderTipNotEditableKey" = "นี่คือแถบเลื่อนที่ไม่สามารถแก้ไขได้ ค่าต่ำสุดคือ %@ และค่าสูงสุดคือ %@";

/* FUIRangeSliderContentView range slider tip */
"RangeSliderTipKey" = "นี่คือแถบเลื่อนช่วงที่สามารถแก้ไขได้ ค่าต่ำสุดคือ %@ และค่าสูงสุดคือ %@";

/* FUIRangeSliderContentView range slider tip unable be editable */
"RangeSliderTipNotEditableKey" = "นี่คือแถบเลื่อนช่วงที่ไม่สามารถแก้ไขได้ ค่าต่ำสุดคือ %@ และค่าสูงสุดคือ %@";

/* FUIRangeSliderContentView slider value textField */
"SliderValueTextFieldKey" = "ฟิลด์ข้อความของค่าแถบเลื่อน";

/* FUIRangeSliderContentView range slider lower value textField */
"RangeSliderLowerValueTextFieldKey" = "ฟิลด์ข้อความของค่าต่ำสุด";

/* FUIRangeSliderContentView range slider upper value textField */
"RangeSliderUpperValueTextFieldKey" = "ฟิลด์ข้อความของค่าสูงสุด";

/* FUIRangeSliderContentView range slider textField hint text */
"RangeSliderTextFieldHintKey" = "คุณสามารถแตะสองครั้งเพื่อป้อนค่าเฉพาะ";

/* FUIRangeSlider slider thumb tip */
"SliderThumbTipKey" = "ปุ่มบนแถบเลื่อน ค่าปัจจุบันคือ";

/* FUIRangeSlider slider hint text */
"SliderThumbHintKey" = "คุณสามารถกวาดนิ้วขึ้นหรือลงเพื่อเปลี่ยนค่า";

/* FUIRangeSlider lower range slider thumb tip */
"LowerRangeSliderThumbTipKey" = "ปุ่มบนแถบเลื่อนของช่วงต่ำสุด ค่าปัจจุบันคือ";

/* FUIRangeSlider lower range slider thumb hint text */
"LowerRangeSliderThumbHintKey" = "คุณสามารถกวาดนิ้วขึ้นหรือลงเพื่อเปลี่ยนค่าต่ำสุด";

/* FUIRangeSlider upper range slider thumb tip */
"UpperRangeSliderThumbTipKey" = "ปุ่มบนแถบเลื่อนของช่วงสูงสุด ค่าปัจจุบันคือ";

/* FUIRangeSlider upper range slider thumb hint text */
"UpperRangeSliderThumbHintKey" = "คุณสามารถกวาดนิ้วขึ้นหรือลงเพื่อเปลี่ยนค่าสูงสุด";

/* FUIRangeSlider slider value tip */
"SliderValueTipKey" = "ค่าปัจจุบันคือ %@";

/* FUIRangeSlider range slider value tip */
"RangeSliderValueTipKey" = "ค่าต่ำสุดในปัจจุบันคือ %@ ค่าสูงสุดคือ %@";

/* FUIRatingControl accessibility label */
"RatingControlAccessibilityLabel" = "%d จาก %d ดาว";

/* FUIRatingControl hint */
"RatingControlHintKey" = "แตะสองครั้งแล้วลากไปทางซ้ายหรือขวาเพื่อปรับค่า";

/* Search Barcode Scan Button */
"BarcodeScanKey" = "สแกนบาร์โค้ด";

"BarcodeScanHintKey" = "แตะสองครั้งเพื่อสแกน";

